In [32]:
import sqlite3
import pandas as pd

## Dataset Overview

- Dataset: Global Superstore Sales Data
- Records include orders, sales, profit, region, category, and customer segments
- This dataset is commonly used for business analytics case stues
-

In [33]:
df = pd.read_csv("D:/Global-Superstore-Sales-Analysis/data/Global_Superstore2.csv", encoding = "latin1")
df.head()

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,City,State,...,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit,Shipping Cost,Order Priority
0,32298,CA-2012-124891,31-07-2012,31-07-2012,Same Day,RH-19495,Rick Hansen,Consumer,New York City,New York,...,TEC-AC-10003033,Technology,Accessories,Plantronics CS510 - Over-the-Head monaural Wir...,2309.650,7,0.0,762.1845,933.57,Critical
1,26341,IN-2013-77878,05-02-2013,07-02-2013,Second Class,JR-16210,Justin Ritter,Corporate,Wollongong,New South Wales,...,FUR-CH-10003950,Furniture,Chairs,"Novimex Executive Leather Armchair, Black",3709.395,9,0.1,-288.7650,923.63,Critical
2,25330,IN-2013-71249,17-10-2013,18-10-2013,First Class,CR-12730,Craig Reiter,Consumer,Brisbane,Queensland,...,TEC-PH-10004664,Technology,Phones,"Nokia Smart Phone, with Caller ID",5175.171,9,0.1,919.9710,915.49,Medium
3,13524,ES-2013-1579342,28-01-2013,30-01-2013,First Class,KM-16375,Katherine Murray,Home Office,Berlin,Berlin,...,TEC-PH-10004583,Technology,Phones,"Motorola Smart Phone, Cordless",2892.510,5,0.1,-96.5400,910.16,Medium
4,47221,SG-2013-4320,05-11-2013,06-11-2013,Same Day,RH-9495,Rick Hansen,Consumer,Dakar,Dakar,...,TEC-SHA-10000501,Technology,Copiers,"Sharp Wireless Fax, High-Speed",2832.960,8,0.0,311.5200,903.04,Critical

## Database Setup & Connection

The dataset is loaded into a SQLite database to performe SQL-based analysis.

In [34]:
conn = sqlite3.connect("sales_performance.db")
df.to_sql("superstore", conn, if_exists='replace', index=False)

51290

## Data Validation

Verify that the data has been successfully loaded into database.

In [35]:
query = "SELECT * FROM superstore LIMIT 5;"
pd.read_sql(query, conn)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,City,State,...,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit,Shipping Cost,Order Priority
0,32298,CA-2012-124891,31-07-2012,31-07-2012,Same Day,RH-19495,Rick Hansen,Consumer,New York City,New York,...,TEC-AC-10003033,Technology,Accessories,Plantronics CS510 - Over-the-Head monaural Wir...,2309.650,7,0.0,762.1845,933.57,Critical
1,26341,IN-2013-77878,05-02-2013,07-02-2013,Second Class,JR-16210,Justin Ritter,Corporate,Wollongong,New South Wales,...,FUR-CH-10003950,Furniture,Chairs,"Novimex Executive Leather Armchair, Black",3709.395,9,0.1,-288.7650,923.63,Critical
2,25330,IN-2013-71249,17-10-2013,18-10-2013,First Class,CR-12730,Craig Reiter,Consumer,Brisbane,Queensland,...,TEC-PH-10004664,Technology,Phones,"Nokia Smart Phone, with Caller ID",5175.171,9,0.1,919.9710,915.49,Medium
3,13524,ES-2013-1579342,28-01-2013,30-01-2013,First Class,KM-16375,Katherine Murray,Home Office,Berlin,Berlin,...,TEC-PH-10004583,Technology,Phones,"Motorola Smart Phone, Cordless",2892.510,5,0.1,-96.5400,910.16,Medium
4,47221,SG-2013-4320,05-11-2013,06-11-2013,Same Day,RH-9495,Rick Hansen,Consumer,Dakar,Dakar,...,TEC-SHA-10000501,Technology,Copiers,"Sharp Wireless Fax, High-Speed",2832.960,8,0.0,311.5200,903.04,Critical

### Data Cleaning

Before analyzing sales performance, it is important to ensure data quality.  
This section covers **Python-based cleaning** (fixing issues in raw data) and **SQL-based validation** (checking data integrity after loading into database).

- Checked missing values → none found.

In [36]:
# 1. Check missing values
df.isnull().sum()

Row ID                0
Order ID              0
Order Date            0
Ship Date             0
Ship Mode             0
Customer ID           0
Customer Name         0
Segment               0
City                  0
State                 0
Country               0
Postal Code       41296
Market                0
Region                0
Product ID            0
Category              0
Sub-Category          0
Product Name          0
Sales                 0
Quantity              0
Discount              0
Profit                0
Shipping Cost         0
Order Priority        0
dtype: int64

### Missing Values Check:
- Found 41,266 missing values in Postal Code.
- Other columns are complete.
- Since City, State, Country, and Region are available, Postal Code was dropped from analysis.

In [37]:
df = df.drop(columns=['Postal Code'])


- Dropped row‑level duplicates. esent.

In [38]:
# 2. Check duplicate records
df.duplicated().sum()
df.drop_duplicates(inplace=True)

- Validated discount values → all between 0–1.

In [39]:
# 3. Validate discount values
df['Discount'].unique()

array([0.   , 0.1  , 0.2  , 0.4  , 0.15 , 0.3  , 0.5  , 0.17 , 0.47 ,
       0.25 , 0.002, 0.07 , 0.32 , 0.27 , 0.7  , 0.35 , 0.6  , 0.65 ,
       0.8  , 0.57 , 0.37 , 0.402, 0.55 , 0.202, 0.45 , 0.602, 0.85 ])

- Outlier detection showed extreme negative profits.

In [40]:
# 4. Detect outliers in Sales & Profit
df[['Sales','Profit']].describe()

              Sales        Profit
count  51290.000000  51290.000000
mean     246.490581     28.610982
std      487.565361    174.340972
min        0.444000  -6599.978000
25%       30.758625      0.000000
50%       85.053000      9.240000
75%      251.053200     36.810000
max    22638.480000   8399.976000

- Converted dates to YYYY-MM-DD format.

In [41]:
# 5. Convert Order Date to proper datetime format
df['Order Date'] = pd.to_datetime(df['Order Date'], dayfirst=True, errors='coerce')
df['Ship Date'] = pd.to_datetime(df['Ship Date'], dayfirst=True, errors='coerce')

 - Order IDs repeat due to multi-line orders (valid case).

In [42]:
# Check duplicates only on Order ID
dup_order_ids = df[df.duplicated(subset=['Order ID'], keep=False)]
print("Total duplicate Order IDs:", dup_order_ids['Order ID'].nunique())

Total duplicate Order IDs: 12778

- Verified Order ID + Product ID → no true duplicates.

In [43]:
# Now check duplicates on Order ID + Product ID
dup_order_products = df[df.duplicated(subset=['Order ID','Product ID'], keep=False)]
print("Total duplicate Order+Product pairs:", dup_order_products.shape[0])

Total duplicate Order+Product pairs: 76

- Removed any exact duplicates if present.

In [44]:
# Remove true duplicates (same Order ID + Product ID)
df = df.drop_duplicates(subset=['Order ID','Product ID'])

In [45]:
# Show a few examples
dup_order_products.head(10)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,City,State,...,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit,Shipping Cost,Order Priority
544,2378,MX-2012-111178,2012-05-04,2012-05-09,Standard Class,AG-10900,Arthur Gainer,Consumer,Mexico City,Distrito Federal,...,OFF-AP-10001106,Office Supplies,Appliances,"Hamilton Beach Stove, White",3242.880,9,0.00,324.1800,279.53,Medium
778,34480,CA-2014-152912,2014-11-10,2014-11-13,Second Class,BM-11650,Brian Moss,Corporate,Columbia,Maryland,...,OFF-ST-10003208,Office Supplies,Storage,Adjustable Depth Letter/Legal Cart,1633.140,9,0.00,473.6106,232.86,Critical
1057,29885,IN-2013-52804,2013-07-10,2013-07-14,Standard Class,GA-14515,George Ashbrook,Consumer,Ballarat,Victoria,...,OFF-AP-10000729,Office Supplies,Appliances,"KitchenAid Refrigerator, White",2367.360,5,0.10,604.8600,196.63,High
1061,34481,CA-2014-152912,2014-11-10,2014-11-13,Second Class,BM-11650,Brian Moss,Corporate,Columbia,Maryland,...,OFF-ST-10003208,Office Supplies,Storage,Adjustable Depth Letter/Legal Cart,544.380,3,0.00,157.8702,196.07,Critical
4491,29853,IN-2012-38657,2012-11-05,2012-11-06,First Class,RM-19375,Raymond Messe,Consumer,Bangkok,Bangkok,...,FUR-CH-10002510,Furniture,Chairs,"Office Star Steel Folding Chair, Adjustable",343.830,5,0.27,89.4300,72.95,Medium
4816,8003,MX-2012-137561,2012-12-03,2012-12-07,Standard Class,LS-17200,Luke Schmidt,Corporate,Rancagua,O'Higgins,...,FUR-CH-10000892,Furniture,Chairs,"SAFCO Executive Leather Armchair, Red",615.240,2,0.00,12.2800,68.73,Medium
4946,31727,US-2013-123750,2013-04-16,2013-04-22,Standard Class,RB-19795,Ross Baird,Home Office,Gastonia,North Carolina,...,TEC-AC-10004659,Technology,Accessories,Imation Secure+ Hardware Encrypted USB 2.0 Fla...,408.744,7,0.20,76.6395,67.33,Low
5091,2377,MX-2012-111178,2012-05-04,2012-05-09,Standard Class,AG-10900,Arthur Gainer,Consumer,Mexico City,Distrito Federal,...,OFF-AP-10001106,Office Supplies,Appliances,"Hamilton Beach Stove, White",720.640,2,0.00,72.0400,65.58,Medium
5092,29887,IN-2013-52804,2013-07-10,2013-07-14,Standard Class,GA-14515,George Ashbrook,Consumer,Ballarat,Victoria,...,OFF-AP-10000729,Office Supplies,Appliances,"KitchenAid Refrigerator, White",473.472,1,0.10,120.9720,65.57,High
5096,50688,IV-2013-8930,2013-09-04,2013-09-04,Same Day,MJ-7740,Max Jones,Consumer,Abidjan,Lagunes,...,TEC-STA-10003330,Technology,Machines,"StarTech Printer, Red",506.640,2,0.00,217.8000,65.54,Medium

### Duplicate Check:
- Found 12,770 duplicate Order IDs.
- Verified using Order ID + Product ID as unique key.
- Result: No true duplicates. Order IDs repeat because each order contains multiple products (valid case).

### Missing Values Validation:
- Checked Order Date and Ship Date for NULL values using SQL.
- Result: No missing values found.
- Confirms dataset integrity for time-series analysis.

In [46]:
# Check for missing values 
query = """
SELECT * 
FROM superstore
WHERE "Order Date" IS NULL OR "Ship Date" IS NULL;
"""
pd.read_sql(query, conn)

Empty DataFrame
Columns: [Row ID, Order ID, Order Date, Ship Date, Ship Mode, Customer ID, Customer Name, Segment, City, State, Country, Postal Code, Market, Region, Product ID, Category, Sub-Category, Product Name, Sales, Quantity, Discount, Profit, Shipping Cost, Order Priority]
Index: []

[0 rows x 24 columns]

### Duplicate Check (SQL):
- Found 12,770 duplicate Order IDs.
- This is expected because one order can contain multiple products (multi-line orders).
- Verified with Order ID + Product ID → no true duplicates.

In [47]:
# Check for duplicates

query = """
SELECT "Order ID", COUNT(*) AS duplicate_count
FROM superstore
GROUP BY "Order ID"
HAVING COUNT(*) > 1;
"""
pd.read_sql(query, conn)

           Order ID  duplicate_count
0      AE-2011-9160                2
1      AE-2013-1130                2
2      AE-2013-1530                2
3      AE-2014-3830                6
4      AG-2011-1390                2
...             ...              ...
12773  ZI-2014-5970                3
12774  ZI-2014-6740                6
12775  ZI-2014-7160                3
12776  ZI-2014-7610                2
12777  ZI-2014-9550                2

[12778 rows x 2 columns]

### Discount Validation:
- Checked all unique discount values using SQL.
- Range observed: 0.00 to 0.85.
- Discounts above 0.30 consistently lead to negative profits (validated in analysis section).
- Confirms dataset integrity and highlights business impact of high discounts.

In [48]:
# Validate discount values

query = """
SELECT DISTINCT Discount
FROM superstore
ORDER BY Discount;
"""
pd.read_sql(query, conn)

    Discount
0      0.000
1      0.002
2      0.070
3      0.100
4      0.150
5      0.170
6      0.200
7      0.202
8      0.250
9      0.270
10     0.300
11     0.320
12     0.350
13     0.370
14     0.400
15     0.402
16     0.450
17     0.470
18     0.500
19     0.550
20     0.570
21     0.600
22     0.602
23     0.650
24     0.700
25     0.800
26     0.850

### Extreme Value Validation:
- Checked for negative sales and extreme losses (Profit < -10,000).
- Result: [No records found / X records flagged].
- Confirms dataset integrity and highlights potential outliers.

In [49]:
# Validate Negative or Extreme Sales/Profit

query = """
SELECT *
FROM superstore
WHERE Sales < 0 OR Profit < -10000;
"""
pd.read_sql(query, conn)

Empty DataFrame
Columns: [Row ID, Order ID, Order Date, Ship Date, Ship Mode, Customer ID, Customer Name, Segment, City, State, Country, Postal Code, Market, Region, Product ID, Category, Sub-Category, Product Name, Sales, Quantity, Discount, Profit, Shipping Cost, Order Priority]
Index: []

[0 rows x 24 columns]

## Key Business Metrics (KPIs)
This section provides a high-level overview of total 
sales, profit, and overall business performance

In [50]:
# 1. KPI Summary 
query_kpi = """ 
SELECT 
    ROUND(SUM(Sales),2) AS total_sales,
    ROUND(SUM(Profit),2) AS total_profit,
    ROUND(SUM(Profit)/SUM(Sales),4) AS profit_margin_pct,
    COUNT(DISTINCT "Order ID") AS total_orders 
FROM superstore; """ 

df_kpi = pd.read_sql(query_kpi, conn)
df_kpi

   total_sales  total_profit  profit_margin_pct  total_orders
0  12642501.91    1467457.29             0.1161         25035

## Category-wise Sales & Profit

Category analysis: Compare sales, profit, and margin % across product categories.

In [51]:
# 2. Category-wise Sales & Profit 
query_category = """ 
SELECT 
    Category, ROUND(SUM(Sales),2) AS total_sales,
    ROUND(SUM(Profit),2) AS total_profit
FROM superstore
GROUP BY Category 
ORDER BY total_profit DESC;
""" 

df_category = pd.read_sql(query_category, conn)
df_category

          Category  total_sales  total_profit
0       Technology   4744557.50     663778.73
1  Office Supplies   3787070.23     518473.83
2        Furniture   4110874.19     285204.72

## Loss-Making Sub-Categories

Identifying sub-categories that consistently generate losses helps in cost control and pricing strategy.

In [52]:
# 3. Loss-Making Sub-Categories 
query_loss = """ 

    SELECT "Sub-Category",
    ROUND(SUM(Sales),2) AS total_sales,
    ROUND(SUM(Profit),2) AS total_profit 
FROM superstore 
GROUP BY "Sub-Category" 
HAVING total_profit < 0 
ORDER BY total_profit; 
""" 

df_loss = pd.read_sql(query_loss, conn)
df_loss

  Sub-Category  total_sales  total_profit
0       Tables    757041.92     -64083.39

## 🔝 Top 10 Sub-Categories by Profit
Show the top 10 Sub-Categories contributing highest profit

In [53]:
query_sub_category = """
SELECT "SUb-Category",
    ROUND(SUM(Profit),2) AS total_profit
FROM superstore
GROUP BY "Sub-Category"
ORDER BY total_profit DESC
LIMIT 10;
"""
df_sub_categories = pd.read_sql(query_sub_category, conn)
df_sub_categories

  Sub-Category  total_profit
0      Copiers     258567.55
1       Phones     216717.01
2    Bookcases     161924.42
3   Appliances     141680.59
4       Chairs     140396.27
5  Accessories     129626.31
6      Storage     108461.49
7      Binders      72449.85
8        Paper      59207.68
9     Machines      58867.87

### Top Products

Show the 10 products contributing highest profit.

In [54]:
# Top Profitable Products
query_products = """
SELECT 
    "Product Name",
    ROUND(SUM(Profit),2) AS total_profit
FROM superstore
GROUP BY "Product Name"
ORDER BY total_profit DESC
LIMIT 10;

"""
df_products = pd.read_sql(query_products, conn)
df_products

                                        Product Name  total_profit
0              Canon imageCLASS 2200 Advanced Copier      25199.93
1                       Cisco Smart Phone, Full Size      17238.52
2                    Motorola Smart Phone, Full Size      17027.11
3                                  Hoover Stove, Red      11807.97
4               Sauder Classic Bookcase, Traditional      10672.07
5  Harbour Creations Executive Leather Armchair, ...      10427.33
6                       Nokia Smart Phone, Full Size       9938.20
7                  Cisco Smart Phone, with Caller ID       9786.64
8                  Nokia Smart Phone, with Caller ID       9465.33
9                                 Belkin Router, USB       8955.02

### Discount impact

Analyze how different discount levels affect average profit.

In [55]:
# Discount Impact
query_discount = """
SELECT 
    ROUND(Discount,2) AS discount_level,
    ROUND(AVG(Profit),2) AS avg_profit
FROM superstore
GROUP BY discount_level
ORDER BY discount_level
"""
df_discount = pd.read_sql(query_discount, conn)
df_discount

    discount_level  avg_profit
0             0.00       62.05
1             0.07      140.99
2             0.10       63.68
3             0.15       50.60
4             0.17       38.32
5             0.20       23.24
6             0.25        4.04
7             0.27       -4.32
8             0.30      -57.90
9             0.32      -88.56
10            0.35     -116.14
11            0.37      -78.46
12            0.40      -47.30
13            0.45      -41.61
14            0.47      -42.98
15            0.50      -97.14
16            0.55     -315.07
17            0.57     -526.13
18            0.60      -83.22
19            0.65     -366.00
20            0.70     -104.34
21            0.80     -122.20
22            0.85    -1534.33

### Yearly trend 

Track total sales by year to see growth or decline.

In [56]:
# Monthly trend
query_monthly = """
SELECT 
    STRFTIME('%Y-%m', DATE(
        substr("Order Date", 7, 4) || '-' || 
        substr("Order Date", 4, 2) || '-' || 
        substr("Order Date", 1, 2)
    )) AS month,
    ROUND(SUM(Sales),2) AS total_sales
FROM superstore
GROUP BY month
ORDER BY month;
"""
df_monthly = pd.read_sql(query_monthly, conn)
print(df_monthly.head())

# Quarterly trend
query_quarterly = """
SELECT 
    STRFTIME('%Y', DATE(
        substr("Order Date", 7, 4) || '-' || 
        substr("Order Date", 4, 2) || '-' || 
        substr("Order Date", 1, 2)
    )) AS year,
    ((CAST(substr("Order Date", 4, 2) AS INTEGER)-1)/3 + 1) AS quarter,
    ROUND(SUM(Sales),2) AS total_sales
FROM superstore
GROUP BY year, quarter
ORDER BY year, quarter;
"""
df_quarterly = pd.read_sql(query_quarterly, conn)
print(df_quarterly.head())

     month  total_sales
0  2011-01     98898.49
1  2011-02     91152.16
2  2011-03    145729.37
3  2011-04    116915.76
4  2011-05    146747.84
   year  quarter  total_sales
0  2011        1    335780.01
1  2011        2    478870.98
2  2011        3    613306.37
3  2011        4    831493.54
4  2012        1    399367.71

## Regional Sales & Profit Analysis 

Regional analysis highlights geographical performance differences 
and support regional business strategy.

In [57]:
query_region = """
SELECT 
    Region,
    ROUND(SUM(Sales),2) AS total_sales,
    ROUND(SUM(Profit),2) AS total_profit,
    ROUND(SUM(Profit)/SUM(Sales),4) AS profit_margin_pct
FROM superstore
GROUP BY Region
ORDER BY total_profit DESC;

"""
df_region = pd.read_sql(query_region, conn) 
df_region

            Region  total_sales  total_profit  profit_margin_pct
0          Central   2822302.52     311403.98             0.1103
1            North   1248165.60     194597.95             0.1559
2       North Asia    848309.78     165578.42             0.1952
3            South   1600907.04     140355.77             0.0877
4     Central Asia    752826.57     132480.19             0.1760
5          Oceania   1100184.61     120089.11             0.1092
6             West    725457.82     108418.45             0.1494
7             East    678781.24      91522.78             0.1348
8           Africa    783773.21      88871.63             0.1134
9             EMEA    806161.31      43897.97             0.0545
10       Caribbean    324280.86      34571.32             0.1066
11  Southeast Asia    884423.17      17852.33             0.0202
12          Canada     66928.17      17817.39             0.2662

## Customer Segment Profitability 

Understanding which customer segments contribute most to profit 
helps prioritize marketing and retention strategies.

In [58]:
segment_query = """
SELECT
    Segment,
    ROUND(SUM(Sales),2) AS total_sales,
    ROUND(SUM(Profit),2) AS total_profit,
    ROUND(SUM(Profit)/SUM(Sales),4) AS profit_margin_pct
FROM superstore
GROUP BY Segment
ORDER BY total_profit DESC;
"""
df_segment = pd.read_sql(segment_query, conn)
df_segment

       Segment  total_sales  total_profit  profit_margin_pct
0     Consumer   6507949.42     749239.78             0.1151
1    Corporate   3824697.52     441208.33             0.1154
2  Home Office   2309854.97     277009.18             0.1199

### Top Customers 

Identify top customers by profit contribution

In [59]:
query_customers = """
SELECT 
    "Customer Name", SUM(Profit) AS total_profit,
    ROUND(SUM(Profit)/SUM(Sales),4) AS profit_margin_pct
FROM superstore
GROUP BY "Customer Name"
ORDER BY total_profit DESC
LIMIT 10;
"""

df_customers = pd.read_sql(query_customers, conn)
df_customers

     Customer Name  total_profit  profit_margin_pct
0     Tamara Chand    8672.89890             0.2315
1     Raymond Buch    8453.04950             0.2856
2     Sanjit Chand    8205.37990             0.3094
3     Hunter Lopez    7816.56778             0.2585
4      Bill Eplett    7410.00530             0.2602
5      Harry Marie    6958.28640             0.2443
6     Susan Pistek    6484.40726             0.2234
7  Mike Gockenbach    6458.67620             0.2763
8    Adrian Barton    6417.28450             0.2554
9     Tom Ashbrook    6311.97910             0.1559

### Shipping Mode Analysis 
Compare profit by shipping mode(Same Day, First Class, etc):

In [60]:
query_shipping_mode = """
SELECT 
    TRIM("Ship Mode") AS Ship_Mode, 
    ROUND(SUM(Sales), 2) AS total_sales, 
    ROUND(SUM(Profit), 2) AS total_profit
FROM superstore
GROUP BY TRIM("Ship Mode")
ORDER BY total_profit DESC;
"""

df_shipping_mode = pd.read_sql(query_shipping_mode, conn)
df_shipping_mode

        Ship_Mode  total_sales  total_profit
0  Standard Class   7578652.11     890596.02
1    Second Class   2565671.68     292583.53
2     First Class   1830976.14     208104.68
3        Same Day    667201.98      76173.07

### Data Quality Summary
- Missing Postal Codes: 41,266 (dropped as City/State/Region are available)
- Duplicate Order IDs: 12,770 (valid multi-line orders, not errors)
- True Duplicates (Order+Product): 0 (no actual duplicate records)
- Extreme Values Flagged: 0 (no negative sales or extreme profit losses)

**Conclusion:** Dataset is clean and validated. Order IDs repeat due to multi-product orders, which is expected business behavior.

In [61]:
summary = {
    "Metric": [
        "Missing Postal Codes",
        "Duplicate Order IDs",
        "True Duplicates (Order+Product)",
        "Extreme Values Flagged"
    ],
    "Result": [41266, 12770, 0, 0]
}

df_quality = pd.DataFrame(summary)
df_quality

                            Metric  Result
0             Missing Postal Codes   41266
1              Duplicate Order IDs   12770
2  True Duplicates (Order+Product)       0
3           Extreme Values Flagged       0

In [62]:
# 10. Save all sheets into one Excel 
with pd.ExcelWriter("Sales_Performance_Dashboard.xlsx") as writer:
    df_kpi.to_excel(writer, sheet_name="KPIs", index=False)
    df_category.to_excel(writer, sheet_name="Category", index=False)
    df_sub_categories.to_excel(writer, sheet_name="Top_Sub_Category", index=False)
    df_loss.to_excel(writer, sheet_name="Loss_SubCategories", index=False)
    df_products.to_excel(writer, sheet_name="Top_Products", index=False)
    df_discount.to_excel(writer, sheet_name="Discount_Impact", index=False)
    df_region.to_excel(writer, sheet_name="Region", index=False)
    df_segment.to_excel(writer, sheet_name="Segment", index=False)
    df_monthly.to_excel(writer, sheet_name="Month_Trend", index=False)
    df_quarterly.to_excel(writer, sheet_name="Quarterly_Trend", index=False)
    df_customers.to_excel(writer, sheet_name="Top_Customers", index=False)
    df_shipping_mode.to_excel(writer, sheet_name="Shipping_Mode", index=False)
    df_quality.to_excel(writer, sheet_name="Data_Quality", index=False)

In [63]:
import pandas as pd

# Path to your saved Excel file
file_path = "Sales_Performance_Dashboard.xlsx"

# Load the Excel file
xls = pd.ExcelFile(file_path)

# Print all sheet names
print("Sheets saved in the Excel file:")
print(xls.sheet_names)

# Optional: check if expected sheets exist
expected_sheets = [
    "KPIs", "Category", "Loss_SubCategories", "Top_Products",
    "Discount_Impact", "Region", "Segment", "Month_Trend",
    "Quarterly_Trend", "Top_Customers", "Shipping_Mode", "Data_Quality"
]

missing = [s for s in expected_sheets if s not in xls.sheet_names]
if missing:
    print("⚠️ Missing sheets:", missing)
else:
    print("✅ All expected sheets are present!")

Sheets saved in the Excel file:
['KPIs', 'Category', 'Top_Sub_Category', 'Loss_SubCategories', 'Top_Products', 'Discount_Impact', 'Region', 'Segment', 'Month_Trend', 'Quarterly_Trend', 'Top_Customers', 'Shipping_Mode', 'Data_Quality']
✅ All expected sheets are present!

 ## Key Insights
 Technology category delivers the highest profit ($664K), while Furniture lags with low margins (6.9%).

Tables sub‑category is a loss driver ($64K loss) due to high discounts (29%).

Discounts above 25% consistently push profits negative, confirming a critical threshold.

Consumer & Corporate segments dominate profitability (~$749K and ~$441K), while Home Office trails.

Top customers (e.g., Tamara Chand, ~$8.7K profit, 23% margin) drive significant value.

Standard Class shipping is most efficient (~$891K profit), while Same Day shipping yields the lowest (~$76K).

Seasonal peaks in Q4 highlight opportunities for targeted promotions and inventory planning.

## Business Recommendations

1. **Cap discounts at 25%** to prevent consistent losses beyond this threshold.
2. **Revisit pricing strategy for Tables** sub-category, which shows high sales but negative profit.
3. **Focus marketing and retention** on top 10 customers, who deliver 20%+ margins.
4. **Promote Standard Class shipping** as the most cost-efficient delivery mode.
5. **Optimize operations in low-margin regions** (South, EMEA, Southeast Asia) to improve profitability.
6. **Align inventory planning** with Consumer and Corporate segments, which consistently generate higher profits.
7. **Leverage seasonal peaks (Q4)** for targeted promotions and inventory stocking.